# -*- coding: utf-8 -*-

##############################################################################
#a########  "قُلۡ بِفَضلِ ٱللَّهِ وَبِرَحمَتِهِۦ فَبِذَٰلِكَ فَليَفرَحُواْ هُوَ خَيرُُ مِّمَّا يَجمَعُونَ"  #########
##############################################################################

from gi.repository import Gtk


class About(Gtk.AboutDialog):
    
    def __init__(self, parent):
        self.parent = parent
        Gtk.AboutDialog.__init__(self, parent = self.parent, wrap_license = True)
        self.set_program_name("برنامج دواوين العرب")
        self.set_version("0.1.20")
        self.set_logo_icon_name('dawawin')
        self.set_comments("""برنامج لقراءة وتخزين شعر العرب""")
        self.set_website("http://www.linuxac.org")
        self.set_website_label('برعاية مجتمع لينكس العربي')
        self.set_authors(['',
                           'أحمد رغدي (المبرمج الأساسي)',
                           'فيصل شامخ (برمجة قارئ الملفات الصوتية) ',
                           'طه زروقي (وحدة اللغة العربية لبايثون)',
                           'أحمد شريف (تجميع المادة الشعرية)',
                           'البكري (أيقونة البرنامج)',
                           'مجتمع لينكس العربي',
                           ])
        self.set_license("""
        برنامج دواوين العرب برمجية حرة ؛
        بإمكانك إعادة توزيعه مع أو دون تعديله ،
        تحت شروط الرخصة "وقف" ، يوزّع برنامج دواوين العرب
        على أمل أن يكون مفيدًا لمن يستخدمه دون أدنى ضمان  ؛
        يمكنك أن تطلع على هذه الرخصة في صفحتها الموجودة
        على هذا الرابط
        http://waqf.ojuba.org/ 
        """)
        self.run()
        self.destroy()
